blog/_posts/2013-11/2013-11-1-python-func-argu.html
---
layout: post
keywords: 
description: 
title: python函数传参，变长参数 
categories: [python]
tags: [python,]
group: archive
icon: code
featured: false
---

<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 函数定义形式</a></li>
<li><a href="#sec-2">2 代码示例</a></li>
<li><a href="#sec-3">3 参考资料</a></li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1">函数定义形式</h2>
<div class="outline-text-2" id="text-1">

<ul>
<li>func(arg1,arg2,…)
</li>
<li>func(arg1,arg2=value2,arg3=value3)
</li>
<li>func(arg1,*arg)
</li>
<li>func(arg1,*arg,**kwargs)
</li>
<li>第一种形式，要求函数调用时参数的个数和顺序与函数定义时一致。
</li>
<li>第二种形式，函数定义时部分形参有默认值，调用时如果没有给这些形参传递实参，那么这些形参就使用默认值。注意的是带默认参数的形参应该在参数列表的最后。
</li>
<li>上述的传参方式函数调用时都不够灵活，比较灵活的方式是关键字赋值，调用时func(arg1=1,arg2=2,arg3=3),为每个形参准确传递参数。如此即使参数顺序不同也不影响传参。
</li>
<li>函数可以接受变长参数。用*,**标识。如函数定义中的*arg，**kwargs.在函数内部，*arg接受的参数存放在以arg为标识符的元组中。**kwargs接受的参数存放在kwargs为标识符的字典中。需要注意的是函数定义时变长参数应放在参数列表最后，同时有*arg,和**kwargs时，**kwargs放在*arg之后。
</li>
</ul>

</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2">代码示例</h2>
<div class="outline-text-2" id="text-2">




<pre class="example">&gt;&gt;&gt; def fun(a,b=2,*arg,**kwargs):
...     print a
...     print b
...     print arg
...     print kwargs
...
&gt;&gt;&gt; fun(1,2,3,4,c=5,d=6)
1
2
(3, 4)
{'c': 5, 'd': 6}
&gt;&gt;&gt; 
</pre>

</div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3">参考资料</h2>
<div class="outline-text-2" id="text-3">

<p><a href="http://lidashuang.is-programmer.com/posts/28252.html">python 可变长参数</a>
</p>
<p>
<a href="http://www.cnblogs.com/tqsummer/archive/2011/01/25/1944416.html">Python中函数的参数定义和可变参数</a>
</p></div>
</div>
